clc
clear 
close all

%{
L1= Revolute('d', 0.103, 'a', 0, 'alpha', 0,'modified', ...
    'I', [0.0111 0 0; 0 0.0108 0.0004; 0 0.0004 0.0072], ...
    'r', [0;-0.0049524; -0.024551], ...
    'm', 2.9258 );

L2 = Revolute('d', 0, 'a', 0, 'alpha', pi/2,'modified','offset',pi/2, ...
    'I', [0.1439 0 0.1988; 0 0.7297 0; 0.1988 0 0.6027], ...
    'r', [0.213; 0;0.13086], ...
    'm', 7.134);

L3 = Revolute('d', 0, 'a', 0.426, 'alpha', 0, 'modified', ...
    'I', [0.0093 0 0.0118; 0 0.3427 0.3405; 0.0118 0.3405 0], ...
    'r', [0.25362;0;0.013039], ...
    'm', 3.5585 );

L4 = Revolute('d', 0.1385, 'a', 0.414, 'alpha', 0, 'modified','offset',pi/2, ...
    'I', [0.0052 0 0; 0 0.0030 0.00017; 0 0.00017 0.0051], ...
    'r', [0; -0.021096; -0.0047608], ...
    'm', 1.6688);
L5 = Revolute('d', 0.134, 'a', 0, 'alpha', pi/2, 'modified', ...
    'I',  [0.0042 0 0; 0 0.0029 -0.0001; 0 -0.0001 0.0041], ...
    'r', [0;0.015883; -0.0053082], ...
    'm', 1.4967 );
L6 = Revolute('d', 0.127, 'a', 0, 'alpha', -pi/2, 'modified', ...
    'I', [0.00051 0 0; 0 0.00051 0; 0 0 0.00014], ...
    'r',  [0;0; -0.041194], ...
    'm', 0.2297 );
robot=SerialLink([L1,L2,L3,L4,L5,L6],'name','VIPER7');  %SerialLink类函数
%通过手动输入各个连杆转角，模型会自动运动到相应位置

q=[1 1 1 1 1 1];
qd=[1,1,1,1,1,1];
qdd=[1,1,1,1,1,1];
torque = robot.rne(q,qd,qdd)'    %获得每个时间点所需要的关节力矩

% 验证惯性矩阵 ，给定每个轴的力矩、角度与角速度，求角加速度
MM1=robot.rne(q,[0,0,0,0,0,0],[1,0,0,0,0,0],'gravity', [0 0 0]); 
MM2=robot.rne(q,[0,0,0,0,0,0],[0,1,0,0,0,0],'gravity', [0 0 0]); 
MM3=robot.rne(q,[0,0,0,0,0,0],[0,0,1,0,0,0],'gravity', [0 0 0]); 
MM4=robot.rne(q,[0,0,0,0,0,0],[0,0,0,1,0,0],'gravity', [0 0 0]); 
MM5=robot.rne(q,[0,0,0,0,0,0],[0,0,0,0,1,0],'gravity', [0 0 0]); 
MM6=robot.rne(q,[0,0,0,0,0,0],[0,0,0,0,0,1],'gravity', [0 0 0]); 
M=[MM1;MM2;MM3;MM4;MM5;MM6];
CG= robot.rne( q, qd, [0,0,0,0,0,0]);

dd_q=M\(torque-CG)';

% 验证柯氏力矩阵
C=robot.coriolis(q,qd);
tauque1= robot.rne( q, qd, [0,0,0,0,0,0],'gravity', [0 0 0]);
 inv(C)*tauque1'

% 验证重力项
tauque2= robot.rne( q, [0,0,0,0,0,0], [0,0,0,0,0,0]);

M*qdd'+C*qd'+tauque2'

%}

% Modified DH

d1 = 0.103;  d2 = 0;  d3 = 0;  d4 = 0.1385;  d5 = 0.134;  d6 = 0.127;
a0 = 0;  a1 = 0;  a2 = 0.426;  a3 = 0.414;  a4 = 0;  a5 = 0;
alp0 = 0;  alp1 = pi/2;  alp2 = 0;  alp3 = 0;  alp4 = pi/2;  alp5 = -pi/2; 
d=[d1,d2,d3,d4,d5,d6];
a=[a0,a1,a2,a3,a4,a5];
alp=[alp0,alp1,alp2,alp3,alp4,alp5];

% DH parameters  th     d    a    alpha  sigma
L1 = Link([0, d(1), a(1), alp(1), 0], 'modified');
L2 = Link([0, d(2), a(2), alp(2), 0], 'modified');
L3 = Link([0, d(3), a(3), alp(3), 0], 'modified');
L4 = Link([0, d(4), a(4), alp(4), 0], 'modified');
L5 = Link([0, d(5), a(5), alp(5), 0], 'modified');  
L6 = Link([0, d(6), a(6), alp(6), 0], 'modified');

m = [2.9258;  7.134;  3.5585;  1.6688;  1.4967;  0.2297];  %kg
L1.m = m(1); L2.m = m(2); L3.m = m(3);
L4.m = m(4); L5.m = m(5); L6.m = m(6);

L1.I = [0.0111 0 0; 0 0.0108 0.0004; 0 0.0004 0.0072];
L2.I = [0.1439 0 0.1988; 0 0.7297 0; 0.1988 0 0.6027];
L3.I = [0.0093 0 0.0118; 0 0.3427 0.3405; 0.0118 0.3405 0.3405];
L4.I = [0.0052 0 0; 0 0.0030 0.00017; 0 0.00017 0.0051];
L5.I =[0.0042 0 0; 0 0.0029 -0.0001; 0 -0.0001 0.0041];
L6.I = [0.00051 0 0; 0 0.00051 0; 0 0 0.00014];

% 连杆质心在I坐标系下的位置
L1.r = [0;-0.0049524;-0.024551];
L2.r = [0.213;0;0.13086]; 
L3.r =  [0.25362;0;0.013039];
L4.r = [ 0;-0.021096;-0.0047608]; 
L5.r = [0;0.015883; -0.0053082]; 
L6.r = [0;0;-0.041194];
L1.Jm=0;L2.Jm=0;L3.Jm=0;L4.Jm=0;L5.Jm=0;L6.Jm=0;
robot = SerialLink([L1, L2, L3, L4, L5, L6],'offset',[0,pi/2,0,pi/2,0,0]); %  ,'offset',[0,pi/2,0,pi/2,0,0]
robot.plot([0 0 0 0 0 0])

q = [20, 20, 30, 40, 50, 60]*pi/180;
qd = [0 0 0 0 0 0]; qdd = [0 0 0 0 0 0];

disp('机器人工具箱结果')
tau=robot.rne(q,qd,qdd,'gravity',[0,0,9.81])  % ,'gravity',[0,0,9.81]
[ta1,ta2,ta3,ta4,ta5,ta6]=dynamic_model(q(1),q(2),q(3),q(4),q(5),q(6),qd(1),qd(2),qd(3),qd(4),qd(5),qd(6),qdd(1),qdd(2),qdd(3),qdd(4),qdd(5),qdd(6));
ta=[ta1,ta2,ta3,ta4,ta5,ta6]
DynNewtonEuler(rad2deg(q)+[0,90,0,90,0,0],qd,qdd,[0;0;9.81],[0;0;0;0;0;0])'





